"""
Написать программу, которая:
- Запрашивает у пользователя строку для поиска.
- Находит и выводит все строки, которые содержат искомую подстроку, а также их количество из следующего файла.
- Сортирует найденные строки в порядке их длины (от самой короткой к самой длинной) и выводит их.
"""

search = str(input("Введите строку: ")) #ввод подстроки
with open("text.txt", "r", encoding="UTF-8") as file: #чтение файла
    lines = file.readlines() #считывание всех строк файла

s = [] #создание пустого списка для нахождения подстроки

for line in lines: #перебор строк текста
    if search in line: #если есть вводимая подстрока
        s.append(line.strip()) #добавление нужных подстрок 
print(s) #вывод самих подстрок

count = len(s) #подсчет количества подстрок
print("Количество подстрок из файла: ", count) #вывод количества

for line in sorted(s, key=len): #перебор строк в отсортированном по длине
    print(line) #вывод подстрок по длине
